
{
  "characters": [
    {
      "characterId": "gob",
      "characterName": "Gob",
      "buildName": "Ranged Tactician",
      "description": "Focuses on utilizing Gob's AR-15 and tactical abilities to control the battlefield and support the team from a distance. Emphasizes consistent ranged damage and utility.",
      "keyAbilities": [
        "Vital Shot",
        "Leadership",
        "Flare x3",
        "Quick Draw"
      ],
      "coreStatsFocus": [
        "Maintains decent HP and Sanity for survivability.",
        "Leverages MV for positioning."
      ],
      "skillsSynergy": [
        "Tactician (TAC): Enhances tactical decision-making and potentially spotting enemy weaknesses.",
        "Survivalist (SUR): Aids in battlefield positioning and navigating hazardous terrain.",
        "Knowledge (KNO): Useful for identifying enemy patterns or environmental clues."
      ],
      "primaryWeaponStrategy": "AR-15 (A4/R5), using Vital Shot to maximize hit probability.",
      "secondaryWeaponStrategy": "Knife (A2) or Wounding Strike (A3/R1) for close-quarters defense or against high-armor targets.",
      "recommendedArsenalFocus": [
        "Increased Ranged Attack or Range",
        "Abilities/Items that Mark targets",
        "Utility items like special ammunition or grenades",
        "Gear enhancing survivability or mobility"
      ],
      "exampleArsenalCardConception": {
        "name": "Marksman's Overwatch Kit",
        "description": "An arsenal designed to enhance a ranged operative's effectiveness and tactical awareness, using available shop items.",
        "globalStatModifiers": {
          "rangedAttackMod": 1
        },
        "items": [
          {
            "name": "Precision Scope",
            "category": "GEAR",
            "type": "Defense Gear (Shop Item)",
            "effect": "Passive: Increase Range by 2.",
            "itemDescription": "Shop item: Enhances the effective range of ranged attacks."
          },
          {
            "name": "Incendiary Ammo (x2)",
            "category": "UTILITY",
            "type": "Ammunition (Shop Item)",
            "qty": 2,
            "abilityName": "Load Incendiary Ammo",
            "isFreeAction": true,
            "effect": "Element of Range Attack is now FIRE for 1 turn. (Item has 3 charges per battle, this arsenal grants 2 uses).",
            "itemDescription": "Shop item: Specialized ammunition that ignites on impact."
          },
          {
            "name": "Targeting Sight",
            "category": "UTILITY",
            "type": "Miscellaneous (Shop Item)",
            "abilityName": "Designate Target",
            "charges": "2",
            "isAction": true,
            "effect": "Inflict MARKED Status on Target. Lasts 2 turns.",
            "itemDescription": "Shop item: Advanced sight that paints a target for enhanced engagement."
          },
          {
            "name": "Leather Armor",
            "category": "GEAR",
            "type": "Defense Gear (Shop Item)",
            "effect": "Passive: Increase Max HP by 1.",
            "itemDescription": "Shop item: Basic armor providing a small health boost."
          }
        ]
      },
      "playstyleSummary": "Gob should prioritize maintaining distance, utilizing cover if available, and using his AR-15 with Vital Shot for consistent damage. Leadership should be used to buff allies before key engagements. Flares are critical for visibility and countering stealth. Quick Draw provides defensive repositioning.",
      "counterPlayConsiderations": "Vulnerable to fast melee attackers if caught out of position. May struggle against multiple enemies without AoE options unless provided by an Arsenal."
    },
    {
      "characterId": "gob",
      "characterName": "Gob",
      "buildName": "Close Quarters Disruptor",
      "description": "Focuses on Gob's melee prowess with his Knife and Wounding Strike, combined with Quick Draw for battlefield control and Leadership for team support. This build emphasizes getting close, dealing armor-ignoring damage, and creating openings.",
      "keyAbilities": [
        "Wounding Strike",
        "Quick Draw",
        "Leadership",
        "Flare x3"
      ],
      "coreStatsFocus": [
        "Emphasizes HP and Sanity for survivability in melee.",
        "Leverages MV for closing distances and positioning."
      ],
      "skillsSynergy": [
        "Tactician (TAC): Identifying enemy weaknesses for Wounding Strike or disrupting key targets.",
        "Survivalist (SUR): Navigating terrain to get into melee range or escape danger.",
        "Athletics (ATH): Could be useful for maneuvers if points are invested in a custom Gob variant, or for general survivability checks."
      ],
      "primaryWeaponStrategy": "Utilizing Wounding Strike (A3) to bypass armor or an equipped melee weapon like the Elite Tactical Knife.",
      "secondaryWeaponStrategy": "Base Knife (A2) for standard attacks if Wounding Strike is on cooldown or not needed. Using Quick Draw (A3/R3) to control enemy positioning or create space.",
      "recommendedArsenalFocus": [
        "Enhanced Melee Attack via a superior Melee Weapon from the shop.",
        "Increased Defense or HP via Defense Gear from the shop.",
        "Items granting movement abilities or close-range debuffs from the shop.",
        "Gear improving Sanity or resistance to melee-related status effects from the shop."
      ],
      "exampleArsenalCardConception": {
        "name": "Shadow Striker's Kit",
        "description": "An arsenal focusing on close-quarters engagement, utilizing available shop gear for enhanced melee, mobility, and disruption.",
        "globalStatModifiers": {
          "defenseMod": 1
        },
        "items": [
          {
            "name": "Elite Tactical Knife",
            "category": "WEAPON",
            "type": "Melee Weapon (Shop Item)",
            "effect": "A4 Melee. Nimble Class (grants Quick Strike Interrupt). If this weapon triggers a Critical Hit you can attack again. Can trigger once per turn.",
            "itemDescription": "Shop item: A high-quality combat knife designed for swift, precise strikes."
          },
          {
            "name": "Knee Pad",
            "category": "GEAR",
            "type": "Defense Gear (Shop Item)",
            "abilityName": "Evasive Roll",
            "isInterrupt": true,
            "cd": "1 round CD",
            "effect": "Move 2 spaces in any direction.",
            "itemDescription": "Shop item: Allows for quick dodges and repositioning in combat."
          },
          {
            "name": "Pepper Spray",
            "category": "UTILITY",
            "type": "Miscellaneous (Shop Item)",
            "qty": 1,
            "abilityName": "Pepper Spray",
            "isInterrupt": true,
            "charges": "1",
            "effect": "R4 - Blind target for 1 turn.",
            "itemDescription": "Shop item: A potent irritant to disable an enemy temporarily. This arsenal grants 1 charge per battle."
          },
          {
            "name": "Stealth Suit",
            "category": "GEAR",
            "type": "Defense Gear (Shop Item)",
            "effect": "Passive: Lower Range value of all enemy attacks by 2 when targeting the wearer.",
            "itemDescription": "Shop item: A suit designed to reduce visibility and protect during approaches."
          }
        ]
      },
      "playstyleSummary": "Gob should focus on identifying key targets for Wounding Strike. Use Leadership to buff allies before engaging or during crucial moments. Quick Draw is essential for controlling enemy movement, pushing threats away, or pulling allies out of danger. Flares maintain visibility. If equipped with an Arsenal like the 'Shadow Striker's Kit', leverage the upgraded melee weapon and mobility/disruption tools.",
      "counterPlayConsiderations": "Can be kited by highly mobile ranged attackers if unable to close the distance. Multiple tough enemies might overwhelm him if he can't isolate targets or receive support."
    }
  ]
}
